### 📖 Terraform Plan (src/core/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.key_vault_weu.azurerm_key_vault_access_policy.kv_adgroup_admins["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "kv_adgroup_admins" {
      ~ certificate_permissions = [
          - "Backup",
          - "Create",
          - "Delete",
          - "DeleteIssuers",
            "Get",
          - "GetIssuers",
          - "Import",
            "List",
          - "ListIssuers",
          - "ManageContacts",
          - "ManageIssuers",
          - "Purge",
          - "Recover",
          - "Restore",
          - "SetIssuers",
            "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv/objectId/0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      ~ key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      ~ secret_permissions      = [
          - "Backup",
          - "Delete",
            "Get",
            "List",
          - "Purge",
          - "Recover",
          - "Restore",
            "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
        # (5 unchanged attributes hidden)
    }

  # module.key_vault_weu.azurerm_key_vault_access_policy.kv_adgroup_admins["d38daf6e-4e65-46d2-a11a-6e016b29fcbc"] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "kv_adgroup_admins" {
      ~ certificate_permissions = [
          - "Backup",
          - "Create",
          - "Delete",
          - "DeleteIssuers",
            "Get",
          - "GetIssuers",
          - "Import",
            "List",
          - "ListIssuers",
          - "ManageContacts",
          - "ManageIssuers",
          - "Purge",
          - "Recover",
          - "Restore",
          - "SetIssuers",
            "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
        id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv/objectId/d38daf6e-4e65-46d2-a11a-6e016b29fcbc"
      ~ key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      ~ secret_permissions      = [
          - "Backup",
          - "Delete",
            "Get",
            "List",
          - "Purge",
          - "Recover",
          - "Restore",
            "Set",
          + "Delete",
          + "Restore",
          + "Recover",
        ]
        # (5 unchanged attributes hidden)
    }

  # module.storage_accounts_itn.module.iam_adgroup_platform_externals.module.storage_account.azurerm_role_assignment.blob["iopitntfst001|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ba3c79c-8296-4386-99c9-bfca983d15d1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/terraform-state-rg/providers/Microsoft.Storage/storageAccounts/iopitntfst001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../_modules/key_vaults/iam.tf line 13, in module "iam_tlscert_kv_admins":
  13:     has_rbac_support    = azurerm_key_vault.tlscert_itn_01.enable_rbac_authorization

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.key_vault_weu.azurerm_key_vault.io_p_itn_platform_kv_01,
  on ../_modules/key_vaults/kv_italynorth.tf line 10, in resource "azurerm_key_vault" "io_p_itn_platform_kv_01":
  10:   enable_rbac_authorization = true

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

(and 3 more similar warnings elsewhere)
```

</details>
